arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
/*
 *Mail Client Arduino Library for ESP32, version 2.1.4
 *
 * April 12, 2020
 *
 * This library allows ESP32 to send Email with/without attachment and receive Email with/without attachment download through SMTP and IMAP servers.
 *
 * The library supports all ESP32 MCU based modules.
 *
 * The MIT License (MIT)
 * Copyright (c) 2019 K. Suwatchai (Mobizt)
 *
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#ifndef ESP32_MailClient_CPP
#define ESP32_MailClient_CPP

#ifdef ESP32

#include "ESP32_MailClient.h"

struct ESP32_MailClient::IMAP_COMMAND_TYPE
{
  static const uint8_t LOGIN = 0;
  static const uint8_t LIST = 1;
  static const uint8_t SELECT = 2;
  static const uint8_t EXAMINE = 3;
  static const uint8_t STATUS = 4;
  static const uint8_t SEARCH = 5;
  static const uint8_t FETCH_BODY_HEADER = 6;
  static const uint8_t FETCH_BODY_MIME = 7;
  static const uint8_t FETCH_BODY_TEXT = 8;
  static const uint8_t FETCH_BODY_ATTACHMENT = 9;
  static const uint8_t LOGOUT = 10;
};

struct ESP32_MailClient::IMAP_HEADER_TYPE
{
  static const uint8_t FROM = 1;
  static const uint8_t TO = 2;
  static const uint8_t CC = 3;
  static const uint8_t SUBJECT = 4;
  static const uint8_t DATE = 5;
  static const uint8_t MSG_ID = 6;
  static const uint8_t CONT_LANG = 7;
  static const uint8_t ACCEPT_LANG = 8;
};



bool ESP32_MailClient::readMail(IMAPData &imapData)
{

  std::string buf;
  std::string command = "$";

  size_t mailIndex = 0;
  int messageDataIndex = 0;
  int partID = 1;
  int _partID = 1;
  bool res = false;
  bool _res = false;
  bool starttls = imapData._starttls;
  bool connected = false;

  int bufSize = 50;

  char *_val = new char[bufSize];
  char *_part = new char[bufSize];

  unsigned long dataTime = 0;

  int count = 0;

  imapData._net->setDebugCallback(NULL);

  if (imapData._debug)
  {
    ESP32MailDebugInfo(ESP32_MAIL_STR_225);
    ESP32MailDebug(imapData._host.c_str());
    ESP32MailDebug(String(imapData._port).c_str());
  }


  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_50;
    imapData._cbData._status = ESP32_MAIL_STR_51;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    imapData._net->setDebugCallback(ESP32MailDebug);

  if (imapData._rootCA.size() > 0)
    imapData._net->begin(imapData._host.c_str(), imapData._port, ESP32_MAIL_STR_202, (const char *)imapData._rootCA.front());
  else
    imapData._net->begin(imapData._host.c_str(), imapData._port, ESP32_MAIL_STR_202, (const char *)NULL);

  while (!imapData._net->connected() && count < 10)
  {

    count++;

    if (!imapData._net->connect(starttls))
    {

      _imapStatus = IMAP_STATUS_SERVER_CONNECT_FAILED;

      if (imapData._readCallback)
      {
        imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
        imapData._cbData._status = ESP32_MAIL_STR_52;
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }
      if (imapData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
      }
    }
    else
    {
      break;
    }
  }

  if (!imapData._net->connect(starttls))
  {
    goto out;
  }

  connected = true;

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_54;
    imapData._cbData._status = ESP32_MAIL_STR_55;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_228);

  //Don't expect handshake from some servers
  dataTime = millis();

  while (imapData._net->connected() && !imapData._net->getStreamPtr()->available() && millis() - 500 < dataTime)
    delay(0);

  if (imapData._net->connected() && imapData._net->getStreamPtr()->available())
    while (imapData._net->getStreamPtr()->available())
      imapData._net->getStreamPtr()->read();

  imapData.clearMessageData();

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_56;
    imapData._cbData._status = ESP32_MAIL_STR_57;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_229);

  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_130);
  imapData._net->getStreamPtr()->print(imapData._loginEmail.c_str());
  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_131);
  imapData._net->getStreamPtr()->println(imapData._loginPassword.c_str());

  if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::LOGIN))
  {
    _imapStatus = IMAP_STATUS_LOGIN_FAILED;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

  if (imapData._fetchUID.length() > 0)
    imapData._headerOnly = false;
  else
    imapData._headerOnly = true;

  if (imapData._headerOnly)
  {
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_58;
      imapData._cbData._status = ESP32_MAIL_STR_59;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }

