arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
    if (imapData._debug)
      ESP32MailDebugInfo(ESP32_MAIL_STR_230);

    imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_133);
    if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::LIST))
    {
      _imapStatus = IMAP_STATUS_BAD_COMMAND;
      if (imapData._readCallback)
      {
        imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
        imapData._cbData._status = ESP32_MAIL_STR_52;
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }
      if (imapData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
      }
      imapData._cbData.empty();
    }

    if (imapData._readCallback)
    {

      imapData._cbData._info = ESP32_MAIL_STR_60;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);

      for (size_t i = 0; i < imapData._folders.size(); i++)
      {
        imapData._cbData._info = imapData._folders[i];
        imapData._cbData._status = "";
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }

      imapData._cbData._info = ESP32_MAIL_STR_61 + imapData._currentFolder + ESP32_MAIL_STR_97;
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_231);

  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_135);
  imapData._net->getStreamPtr()->print(imapData._currentFolder.c_str());
  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_136);
  if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::EXAMINE))
  {
    _imapStatus = IMAP_STATUS_BAD_COMMAND;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

  if (imapData._headerOnly)
  {

    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_62 + imapData._nextUID;
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);

      imapData._cbData._info = ESP32_MAIL_STR_63;
      memset(_val, 0, bufSize);
      itoa(imapData._totalMessage, _val, 10);
      imapData._cbData._info += _val;
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);

      imapData._cbData._info = ESP32_MAIL_STR_64;
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);

      for (size_t i = 0; i < imapData._flag.size(); i++)
      {
        imapData._cbData._info = imapData._flag[i];
        imapData._cbData._status = "";
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }

      imapData._cbData._info = ESP32_MAIL_STR_65;
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);

      imapData._cbData._info = ESP32_MAIL_STR_66;
      imapData._cbData._status = ESP32_MAIL_STR_67;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
  }

  imapData._msgNum.clear();
  imapData._uidSearch = false;
  imapData._msgID.clear();
  imapData._contentLanguage.clear();
  imapData._acceptLanguage.clear();
  imapData._attachmentCount.clear();
  imapData._totalAttachFileSize.clear();
  imapData._downloadedByte.clear();
  imapData._error.clear();
  imapData._errorMsg.clear();
  imapData._searchCount = 0;

  if (imapData._headerOnly)
  {

    if (imapData._searchCriteria != "")
    {
      if (imapData._debug)
        ESP32MailDebugInfo(ESP32_MAIL_STR_232);

      if (imapData._searchCriteria.find(ESP32_MAIL_STR_137) != std::string::npos)
      {
        imapData._uidSearch = true;
        command += ESP32_MAIL_STR_138;
      }
      command += ESP32_MAIL_STR_139;

      for (size_t i = 0; i < imapData._searchCriteria.length(); i++)
      {
        if (imapData._searchCriteria[i] != ' ' && imapData._searchCriteria[i] != '\r' && imapData._searchCriteria[i] != '\n' && imapData._searchCriteria[i] != '$')
          buf.append(1, imapData._searchCriteria[i]);

        if (imapData._searchCriteria[i] == ' ')
        {
          if ((imapData._uidSearch && buf == ESP32_MAIL_STR_140) || (imapData._unseen && buf.find(ESP32_MAIL_STR_224) != std::string::npos))
            buf.clear();

          if (buf != ESP32_MAIL_STR_141 && buf != "")
          {
            command += ESP32_MAIL_STR_131;
            command += buf;
          }

          buf.clear();
        }
      }

      if (imapData._unseen && imapData._searchCriteria.find(ESP32_MAIL_STR_223) == std::string::npos)
        command += ESP32_MAIL_STR_223;

      if (buf.length() > 0)
      {
        command += ESP32_MAIL_STR_131;
        command += buf;
      }

      imapData._net->getStreamPtr()->println(command.c_str());

      std::string().swap(command);

      if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::SEARCH, 1))
      {
        _imapStatus = IMAP_STATUS_BAD_COMMAND;
        if (imapData._readCallback)
        {
          imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
          imapData._cbData._status = ESP32_MAIL_STR_52;
          imapData._cbData._success = false;
          imapData._readCallback(imapData._cbData);
        }
        if (imapData._debug)
        {
          ESP32MailDebugError();
          ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
        }
        goto out;
      }

      if (imapData._readCallback)
      {

        imapData._cbData._info = ESP32_MAIL_STR_68;
        memset(_val, 0, bufSize);
        itoa(imapData._emailNumMax, _val, 10);
        imapData._cbData._info += _val;
        imapData._cbData._status = "";
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);

        if (imapData._msgNum.size() > 0)
        {

