arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
          imapData._cbData._info = ESP32_MAIL_STR_69;
          memset(_val, 0, bufSize);
          itoa(imapData._searchCount, _val, 10);
          imapData._cbData._info += _val;
          imapData._cbData._info += ESP32_MAIL_STR_70;
          imapData._cbData._status = "";
          imapData._cbData._success = false;
          imapData._readCallback(imapData._cbData);

          imapData._cbData._info = ESP32_MAIL_STR_71;
          memset(_val, 0, bufSize);
          itoa(imapData._msgNum.size(), _val, 10);
          imapData._cbData._info += _val;
          imapData._cbData._info += ESP32_MAIL_STR_70;
          imapData._cbData._status = "";
          imapData._cbData._success = false;
          imapData._readCallback(imapData._cbData);
        }
        else
        {
          imapData._cbData._info = ESP32_MAIL_STR_72;
          imapData._cbData._status = "";
          imapData._cbData._success = false;
          imapData._readCallback(imapData._cbData);
        }
      }
    }
    else
    {

      imapData._msgNum.push_back(imapData._totalMessage);
      if (imapData._readCallback)
      {
        imapData._cbData._info = ESP32_MAIL_STR_73;
        imapData._cbData._status = "";
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }
    }
  }
  else
  {

    imapData._msgNum.push_back(atoi(imapData._fetchUID.c_str()));
  }

  for (int i = 0; i < imapData._messageDataInfo.size(); i++)
    imapData._messageDataInfo[i].clear();

  imapData._messageDataInfo.clear();

  for (int i = 0; i < imapData._msgNum.size(); i++)
  {

    if (imapData._debug)
      ESP32MailDebugInfo(ESP32_MAIL_STR_233);

    if (imapData._readCallback)
    {

      imapData._cbData._info = ESP32_MAIL_STR_74;
      memset(_val, 0, bufSize);
      itoa(i + 1, _val, 10);
      imapData._cbData._info += _val;

      imapData._cbData._status = "";
      if (imapData._uidSearch || imapData._fetchUID.length() > 0)
        imapData._cbData._info += ESP32_MAIL_STR_75;
      else
        imapData._cbData._info += ESP32_MAIL_STR_76;

      memset(_val, 0, bufSize);
      itoa(imapData._msgNum[i], _val, 10);
      imapData._cbData._info += _val;
      imapData._cbData._status = ESP32_MAIL_STR_77;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }

    imapData._date.push_back(std::string());
    imapData._subject.push_back(std::string());
    imapData._subject_charset.push_back(std::string());
    imapData._from.push_back(std::string());
    imapData._from_charset.push_back(std::string());
    imapData._to.push_back(std::string());
    imapData._to_charset.push_back(std::string());
    imapData._cc.push_back(std::string());
    imapData._attachmentCount.push_back(0);
    imapData._totalAttachFileSize.push_back(0);
    imapData._downloadedByte.push_back(0);
    imapData._messageDataCount.push_back(0);
    imapData._error.push_back(false);
    imapData._errorMsg.push_back(std::string());
    imapData._cc_charset.push_back(std::string());
    imapData._msgID.push_back(std::string());
    imapData._acceptLanguage.push_back(std::string());
    imapData._contentLanguage.push_back(std::string());

    std::vector<messageBodyData> d = std::vector<messageBodyData>();

    imapData._messageDataInfo.push_back(d);

    std::vector<messageBodyData>().swap(d);

    if (imapData._uidSearch || imapData._fetchUID.length() > 0)
      imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_142);
    else
      imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_143);

    imapData._net->getStreamPtr()->print(imapData._msgNum[i]);
    imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_144);

    if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::FETCH_BODY_HEADER, 0, mailIndex))
    {
      if (imapData._headerOnly)
        _imapStatus = IMAP_STATUS_IMAP_RESPONSE_FAILED;
      else
        _imapStatus = IMAP_STATUS_BAD_COMMAND;

      if (imapData._readCallback)
      {
        imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
        imapData._cbData._status = ESP32_MAIL_STR_52;
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }
      if (imapData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
      }
      goto out;
    }

    if (!imapData._headerOnly)
    {

      messageDataIndex = 0;
      partID = 1;
      _partID = 1;
      res = false;
      _res = false;

      do
      {

        if (imapData._uidSearch || imapData._fetchUID.length() > 0)
          imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_142);
        else
          imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_143);

        imapData._net->getStreamPtr()->print(imapData._msgNum[i]);
        imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_147);
        imapData._net->getStreamPtr()->print(partID);
        imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_148);

        memset(_part, 0, bufSize);
        memset(_val, 0, bufSize);
        itoa(partID, _val, 10);
        strcpy(_part, _val);
        res = waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::FETCH_BODY_MIME, 0, mailIndex, messageDataIndex, _part);
        if (res)
        {

          if (imapData._messageDataInfo[mailIndex].size() < messageDataIndex + 1)
          {
            messageBodyData b;
            imapData._messageDataInfo[mailIndex].push_back(b);
            b.empty();
            imapData._messageDataCount[mailIndex] = imapData._messageDataInfo[mailIndex].size();
          }

          if (imapData._messageDataInfo[mailIndex][messageDataIndex]._contentType == "")
            continue;

          if (imapData._messageDataInfo[mailIndex][messageDataIndex]._contentType.find(ESP32_MAIL_STR_149) != std::string::npos)
          {
            do
            {

              if (imapData._uidSearch || imapData._fetchUID.length() > 0)
                imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_142);
              else
                imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_143);

              imapData._net->getStreamPtr()->print(imapData._msgNum[i]);
              imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_147);
              imapData._net->getStreamPtr()->print(partID);
              imapData._net->getStreamPtr()->print(".");
              imapData._net->getStreamPtr()->print(_partID);
              imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_148);

              memset(_part, 0, bufSize);
              memset(_val, 0, bufSize);
              itoa(partID, _val, 10);
              strcpy(_part, _val);
              strcat(_part, ".");
              memset(_val, 0, bufSize);
              itoa(_partID, _val, 10);
              strcat(_part, _val);
              _res = waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::FETCH_BODY_MIME, 0, mailIndex, messageDataIndex, _part);

              if (_res)
              {
                messageDataIndex++;
                _partID++;
              }

            } while (_res);
          }
          else
          {
            messageDataIndex++;
          }
          partID++;
        }

