arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
      } while (res);

      if (imapData._saveHTMLMsg || imapData._saveTextMsg || imapData._downloadAttachment)
      {

        if (!_sdOk)
        {
          if (imapData._storageType == MailClientStorageType::SD)
          {
            _sdOk = sdTest();
            if (_sdOk)
              if (!imapData.fsp->exists(imapData._savePath.c_str()))
                createDirs(imapData._savePath);
          }
          else if (imapData._storageType == MailClientStorageType::SPIFFS)
            _sdOk = SPIFFS.begin(true);
        }
      }

      if (imapData._messageDataInfo[mailIndex].size() > 0)
      {
        if (imapData._attachmentCount[mailIndex] > 0 && imapData._readCallback)
        {
          imapData._cbData._info = ESP32_MAIL_STR_78;
          memset(_val, 0, bufSize);
          itoa(imapData._attachmentCount[mailIndex], _val, 10);
          imapData._cbData._info += _val;
          imapData._cbData._info += ESP32_MAIL_STR_79;
          imapData._cbData._status = "";
          imapData._cbData._success = false;
          imapData._readCallback(imapData._cbData);

          for (int j = 0; j < imapData._messageDataInfo[mailIndex].size(); j++)
          {
            if (imapData._messageDataInfo[mailIndex][j]._disposition == ESP32_MAIL_STR_153)
            {
              imapData._cbData._info = imapData._messageDataInfo[mailIndex][j]._filename;
              imapData._cbData._info += ESP32_MAIL_STR_83;
              memset(_val, 0, bufSize);
              itoa(imapData._messageDataInfo[mailIndex][j]._size, _val, 10);
              imapData._cbData._info += _val;
              imapData._cbData._info += ESP32_MAIL_STR_82;
              imapData._cbData._status = "";
              imapData._cbData._success = false;
              imapData._readCallback(imapData._cbData);
            }
          }

          if (imapData._downloadAttachment && _sdOk)
          {
            imapData._cbData._info = ESP32_MAIL_STR_80;
            imapData._cbData._status = ESP32_MAIL_STR_81;
            imapData._cbData._success = false;
            imapData._readCallback(imapData._cbData);
          }
        }

        for (int j = 0; j < imapData._messageDataInfo[mailIndex].size(); j++)
        {

          if (imapData._messageDataInfo[mailIndex][j]._disposition == "")
          {

            if (!imapData._textFormat && imapData._messageDataInfo[mailIndex][j]._contentType != ESP32_MAIL_STR_154)
              continue;

            if (!imapData._htmlFormat && imapData._messageDataInfo[mailIndex][j]._contentType != ESP32_MAIL_STR_155)
              continue;

            if (imapData._uidSearch || imapData._fetchUID.length() > 0)
              imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_142);
            else
              imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_143);

            imapData._net->getStreamPtr()->print(imapData._msgNum[i]);
            imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_147);
            imapData._net->getStreamPtr()->print(imapData._messageDataInfo[mailIndex][j]._part.c_str());
            imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_156);
            if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::FETCH_BODY_TEXT, imapData._message_buffer_size, mailIndex, j))
            {
              _imapStatus = IMAP_STATUS_IMAP_RESPONSE_FAILED;
              if (imapData._readCallback)
              {
                imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
                imapData._cbData._status = ESP32_MAIL_STR_52;
                imapData._cbData._success = false;
                imapData._readCallback(imapData._cbData);
              }
              if (imapData._debug)
              {
                ESP32MailDebugError();
                ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
              }
            }
          }
          else if (imapData._messageDataInfo[mailIndex][j]._disposition == ESP32_MAIL_STR_153 && _sdOk)
          {

            if (imapData._downloadAttachment)
            {
              if (imapData._messageDataInfo[mailIndex][j]._size <= imapData._attacement_max_size)
              {

                if (_sdOk)
                {

                  if (j < imapData._messageDataInfo[mailIndex].size() - 1)
                    if (imapData._messageDataInfo[mailIndex][j + 1]._size > imapData._attacement_max_size)
                      imapData._downloadedByte[mailIndex] += imapData._messageDataInfo[mailIndex][j + 1]._size;

                  if (imapData._uidSearch || imapData._fetchUID.length() > 0)
                    imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_142);
                  else
                    imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_143);

                  imapData._net->getStreamPtr()->print(imapData._msgNum[i]);
                  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_147);
                  imapData._net->getStreamPtr()->print(imapData._messageDataInfo[mailIndex][j]._part.c_str());
                  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_156);
                  if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::FETCH_BODY_ATTACHMENT, imapData._message_buffer_size, mailIndex, j))
                  {
                    _imapStatus = IMAP_STATUS_IMAP_RESPONSE_FAILED;
                    if (imapData._readCallback)
                    {
                      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
                      imapData._cbData._status = ESP32_MAIL_STR_52;
                      imapData._cbData._success = false;
                      imapData._readCallback(imapData._cbData);
                    }
                    if (imapData._debug)
                    {
                      ESP32MailDebugError();
                      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
                    }
                  }

                  delay(0);
                }
              }
              else
              {
                if (j == imapData._messageDataInfo[mailIndex].size() - 1)
                  imapData._downloadedByte[mailIndex] += imapData._messageDataInfo[mailIndex][j]._size;
              }
            }
          }
        }
      }

      if (imapData._storageType == MailClientStorageType::SD)
      {
        if (_sdOk)
          SD.end();
      }
      else if (imapData._storageType == MailClientStorageType::SPIFFS)
      {
        if (_sdOk)
          SPIFFS.end();
      }

      _sdOk = false;
    }

