arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_84;
      memset(_val, 0, bufSize);
      itoa(ESP.getFreeHeap(), _val, 10);
      imapData._cbData._info += _val;
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }

    mailIndex++;
  }

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_85;
    imapData._cbData._status = ESP32_MAIL_STR_86;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_234);

  if (imapData._net->connected())
    while (imapData._net->getStreamPtr()->available())
      imapData._net->getStreamPtr()->read();

  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_146);

  if (!waitIMAPResponse(imapData, 0))
  {
    _imapStatus = IMAP_STATUS_BAD_COMMAND;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_98;
    imapData._cbData._status = ESP32_MAIL_STR_96;
    imapData._cbData._success = true;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_235);

  if (imapData._net->connected())
  {
    while (imapData._net->getStreamPtr()->available())
      imapData._net->getStreamPtr()->read();

    imapData._net->getStreamPtr()->stop();
  }

  imapData._cbData.empty();
  delete[] _val;
  delete[] _part;
  std::string().swap(command);
  std::string().swap(buf);

  return true;

out:

  if (connected)
  {
    if (imapData._net->connected())
    {
      while (imapData._net->getStreamPtr()->available())
        imapData._net->getStreamPtr()->read();
      imapData._net->getStreamPtr()->stop();
    }
  }

  imapData._cbData.empty();
  delete[] _val;
  delete[] _part;
  std::string().swap(command);
  std::string().swap(buf);

  return false;
}

bool ESP32_MailClient::setFlag(IMAPData &imapData, int msgUID, const String &flag)
{
  return _setFlag(imapData, msgUID, flag, 0);
}

bool ESP32_MailClient::addFlag(IMAPData &imapData, int msgUID, const String &flag)
{
  return _setFlag(imapData, msgUID, flag, 1);
}

bool ESP32_MailClient::removeFlag(IMAPData &imapData, int msgUID, const String &flag)
{
  return _setFlag(imapData, msgUID, flag, 2);
}

bool ESP32_MailClient::_setFlag(IMAPData &imapData, int msgUID, const String &flag, uint8_t action)
{

  std::string buf;

  bool starttls = imapData._starttls;
  bool connected = false;

  int bufSize = 50;

  char *_val = new char[bufSize];
  char *_part = new char[bufSize];

  unsigned long dataTime = 0;

  int count = 0;

  imapData._net->setDebugCallback(NULL);

  if (imapData._debug)
  {
    ESP32MailDebugInfo(ESP32_MAIL_STR_225);
    ESP32MailDebug(imapData._host.c_str());
    ESP32MailDebug(String(imapData._port).c_str());
  }

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_50;
    imapData._cbData._status = ESP32_MAIL_STR_51;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    imapData._net->setDebugCallback(ESP32MailDebug);

  if (imapData._rootCA.size() > 0)
    imapData._net->begin(imapData._host.c_str(), imapData._port, ESP32_MAIL_STR_202, (const char *)imapData._rootCA.front());
  else
    imapData._net->begin(imapData._host.c_str(), imapData._port, ESP32_MAIL_STR_202, (const char *)NULL);

  while (!imapData._net->connected() && count < 10)
  {

    count++;

    if (!imapData._net->connect(starttls))
    {

      _imapStatus = IMAP_STATUS_SERVER_CONNECT_FAILED;

      if (imapData._readCallback)
      {
        imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
        imapData._cbData._status = ESP32_MAIL_STR_52;
        imapData._cbData._success = false;
        imapData._readCallback(imapData._cbData);
      }
      if (imapData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
      }
    }
    else
    {
      break;
    }
  }

  if (!imapData._net->connect(starttls))
  {
    goto out;
  }

  connected = true;

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_54;
    imapData._cbData._status = ESP32_MAIL_STR_55;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_228);

  //Don't expect handshake from some servers
  dataTime = millis();

  while (imapData._net->connected() && !imapData._net->getStreamPtr()->available() && millis() - 500 < dataTime)
    delay(0);

  if (imapData._net->connected() && imapData._net->getStreamPtr()->available())
    while (imapData._net->getStreamPtr()->available())
      imapData._net->getStreamPtr()->read();

  imapData.clearMessageData();

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_56;
    imapData._cbData._status = ESP32_MAIL_STR_57;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_229);

  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_130);
  imapData._net->getStreamPtr()->print(imapData._loginEmail.c_str());
  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_131);
  imapData._net->getStreamPtr()->println(imapData._loginPassword.c_str());

  if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::LOGIN))
  {
    _imapStatus = IMAP_STATUS_LOGIN_FAILED;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

