arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_58;
    imapData._cbData._status = ESP32_MAIL_STR_59;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_230);

  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_133);
  if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::LIST))
  {
    _imapStatus = IMAP_STATUS_BAD_COMMAND;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    imapData._cbData.empty();
  }

  if (imapData._readCallback)
  {

    imapData._cbData._info = ESP32_MAIL_STR_60;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);

    for (size_t i = 0; i < imapData._folders.size(); i++)
    {
      imapData._cbData._info = imapData._folders[i];
      imapData._cbData._status = "";
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }

    imapData._cbData._info = ESP32_MAIL_STR_61 + imapData._currentFolder + ESP32_MAIL_STR_97;
    imapData._cbData._status = "";
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_248);

  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_247);
  imapData._net->getStreamPtr()->print(imapData._currentFolder.c_str());
  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_136);
  if (!waitIMAPResponse(imapData, IMAP_COMMAND_TYPE::EXAMINE))
  {
    _imapStatus = IMAP_STATUS_BAD_COMMAND;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

  if (imapData._debug)
  {
    if (action == 0)
      ESP32MailDebugInfo(ESP32_MAIL_STR_253);
    else if (action == 1)
      ESP32MailDebugInfo(ESP32_MAIL_STR_254);
    else
      ESP32MailDebugInfo(ESP32_MAIL_STR_255);
  }

  imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_249);
  imapData._net->getStreamPtr()->print(msgUID);
  if (action == 0)
    imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_250);
  else if (action == 1)
    imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_251);
  else
    imapData._net->getStreamPtr()->print(ESP32_MAIL_STR_252);
  imapData._net->getStreamPtr()->print(flag);
  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_192);

  if (!getIMAPResponse(imapData))
  {
    _imapStatus = IMAP_STATUS_PARSE_FLAG_FAILED;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_85;
    imapData._cbData._status = ESP32_MAIL_STR_86;
    imapData._cbData._success = false;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_234);

  if (imapData._net->connected())
    while (imapData._net->getStreamPtr()->available())
      imapData._net->getStreamPtr()->read();

  imapData._net->getStreamPtr()->println(ESP32_MAIL_STR_146);

  if (!waitIMAPResponse(imapData, 0))
  {
    _imapStatus = IMAP_STATUS_BAD_COMMAND;
    if (imapData._readCallback)
    {
      imapData._cbData._info = ESP32_MAIL_STR_53 + imapErrorReasonStr();
      imapData._cbData._status = ESP32_MAIL_STR_52;
      imapData._cbData._success = false;
      imapData._readCallback(imapData._cbData);
    }
    if (imapData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(imapErrorReasonStr().c_str(), true);
    }
    goto out;
  }

  if (imapData._readCallback)
  {
    imapData._cbData._info = ESP32_MAIL_STR_98;
    imapData._cbData._status = ESP32_MAIL_STR_96;
    imapData._cbData._success = true;
    imapData._readCallback(imapData._cbData);
  }

  if (imapData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_235);

  if (imapData._net->connected())
  {
    while (imapData._net->getStreamPtr()->available())
      imapData._net->getStreamPtr()->read();

    imapData._net->getStreamPtr()->stop();
  }

  imapData._cbData.empty();
  delete[] _val;
  delete[] _part;
  std::string().swap(buf);

  return true;

out:

  if (connected)
  {
    if (imapData._net->connected())
    {
      while (imapData._net->getStreamPtr()->available())
        imapData._net->getStreamPtr()->read();
      imapData._net->getStreamPtr()->stop();
    }
  }

  imapData._cbData.empty();
  delete[] _val;
  delete[] _part;
  std::string().swap(buf);
  return false;
}


bool ESP32_MailClient::smtpClientAvailable(SMTPData &smtpData, bool available)
{

  if (!smtpData._net->getStreamPtr())
    return false;

  if (available)
    return smtpData._net->getStreamPtr()->connected() && smtpData._net->getStreamPtr()->available();
  else
    return smtpData._net->getStreamPtr()->connected() && !smtpData._net->getStreamPtr()->available();
}

bool ESP32_MailClient::imapClientAvailable(IMAPData &imapData, bool available)
{

  if (!imapData._net->getStreamPtr())
    return false;

  if (available)
    return imapData._net->getStreamPtr()->connected() && imapData._net->getStreamPtr()->available();
  else
    return imapData._net->getStreamPtr()->connected() && !imapData._net->getStreamPtr()->available();
}

void ESP32_MailClient::createDirs(std::string dirs)
{
  std::string dir = "";
  int count = 0;
  for (int i = 0; i < dirs.length(); i++)
  {
    dir.append(1, dirs[i]);
    count++;
    if (dirs[i] == '/')
    {
      if (dir.length() > 0)
        SD.mkdir(dir.substr(0, dir.length() - 1).c_str());
      count = 0;
    }
  }
  if (count > 0)
    SD.mkdir(dir.c_str());
  std::string().swap(dir);
}

bool ESP32_MailClient::sdTest()
{

  if (_sdConfigSet)
    sdBegin(_sck, _miso, _mosi, _ss);
  else
    sdBegin();

  File file = SD.open(ESP32_MAIL_STR_204, FILE_WRITE);
  if (!file)
    return false;

  if (!file.write(32))
    return false;
  file.close();

