arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
  file = SD.open(ESP32_MAIL_STR_204);
  if (!file)
    return false;

  while (file.available())
  {
    if (file.read() != 32)
      return false;
  }
  file.close();

  SD.remove(ESP32_MAIL_STR_204);

  return true;
}

bool ESP32_MailClient::sendMail(SMTPData &smtpData)
{

  _smtpStatus = 0;
  std::string buf;
  std::string buf2;
  int bufSize = 50;
  bool starttls = smtpData._starttls;
  bool connected = false;
  char *_val = new char[bufSize];
  int res = 0;

  smtpData._net->setDebugCallback(NULL);

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_120;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }

  if (smtpData._debug)
  {
    ESP32MailDebugInfo(ESP32_MAIL_STR_236);
    ESP32MailDebug(smtpData._host.c_str());
    ESP32MailDebug(String(smtpData._port).c_str());
  }


  if (smtpData._debug)
    smtpData._net->setDebugCallback(ESP32MailDebug);

  if (smtpData._rootCA.size() > 0)
    smtpData._net->begin(smtpData._host.c_str(), smtpData._port, ESP32_MAIL_STR_202, (const char *)smtpData._rootCA.front());
  else
    smtpData._net->begin(smtpData._host.c_str(), smtpData._port, ESP32_MAIL_STR_202, (const char *)NULL);

  if (smtpData._port == 587)
    starttls = true;

  if (!smtpData._net->connect(starttls))
  {
    _smtpStatus = SMTP_STATUS_SERVER_CONNECT_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }

    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_238);

  connected = true;

  if (!starttls)
  {

    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_121;
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }

    if (waitSMTPResponse(smtpData) != 220)
    {
      _smtpStatus = SMTP_STATUS_SMTP_RESPONSE_FAILED;
      if (smtpData._sendCallback)
      {
        smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
        smtpData._cbData._success = false;
        smtpData._sendCallback(smtpData._cbData);
      }
      if (smtpData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
      }
      goto failed;
    }
  }

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_122;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_239);

  smtpData._net->getStreamPtr()->println(ESP32_MAIL_STR_5);

  if (waitSMTPResponse(smtpData) != 250)
  {
    _smtpStatus = SMTP_STATUS_IDENTIFICATION_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_123;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_240);

  smtpData._net->getStreamPtr()->println(ESP32_MAIL_STR_4);

  if (waitSMTPResponse(smtpData) != 334)
  {
    _smtpStatus = SMTP_STATUS_AUTHEN_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_124;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }
  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_241);

  smtpData._net->getStreamPtr()->println(base64_encode_string((const unsigned char *)smtpData._loginEmail.c_str(), smtpData._loginEmail.length()).c_str());

  if (waitSMTPResponse(smtpData) != 334)
  {
    _smtpStatus = SMTP_STATUS_USER_LOGIN_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  smtpData._net->getStreamPtr()->println(base64_encode_string((const unsigned char *)smtpData._loginPassword.c_str(), smtpData._loginPassword.length()).c_str());

  if (waitSMTPResponse(smtpData) != 235)
  {
    _smtpStatus = SMTP_STATUS_PASSWORD_LOGIN_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_125;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_242);

  if (smtpData._priority > 0 && smtpData._priority <= 5)
  {
    memset(_val, 0, bufSize);
    itoa(smtpData._priority, _val, 10);

    buf2 += ESP32_MAIL_STR_17;
    buf2 += _val;
    buf2 += ESP32_MAIL_STR_34;

    if (smtpData._priority == 1)
    {
      buf2 += ESP32_MAIL_STR_18;
      buf2 += ESP32_MAIL_STR_21;
    }
    else if (smtpData._priority == 3)
    {
      buf2 += ESP32_MAIL_STR_19;
      buf2 += ESP32_MAIL_STR_22;
    }
    else if (smtpData._priority == 5)
    {
      buf2 += ESP32_MAIL_STR_20;
      buf2 += ESP32_MAIL_STR_23;
    }
  }

  buf2 += ESP32_MAIL_STR_10;

  if (smtpData._fromName.length() > 0)
    buf2 += smtpData._fromName;

  buf2 += ESP32_MAIL_STR_14;
  buf2 += smtpData._senderEmail;
  buf2 += ESP32_MAIL_STR_15;
  buf2 += ESP32_MAIL_STR_34;

