arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
  buf += ESP32_MAIL_STR_8;
  buf += ESP32_MAIL_STR_14;
  buf += smtpData._senderEmail;
  buf += ESP32_MAIL_STR_15;
  smtpData._net->getStreamPtr()->println(buf.c_str());

  if (waitSMTPResponse(smtpData) != 250)
  {
    _smtpStatus = SMTP_STATUS_SEND_HEADER_SENDER_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  for (uint8_t i = 0; i < smtpData._recipient.size(); i++)
  {
    if (i == 0)
    {
      buf2 += ESP32_MAIL_STR_11;
      buf2 += ESP32_MAIL_STR_14;
      buf2 += smtpData._recipient[i];
      buf2 += ESP32_MAIL_STR_15;
    }
    else
    {
      buf2 += ESP32_MAIL_STR_13;
      buf2 += smtpData._recipient[i];
      buf2 += ESP32_MAIL_STR_15;
    }

    if (i == smtpData._recipient.size() - 1)
      buf2 += ESP32_MAIL_STR_34;

    buf.clear();

    buf += ESP32_MAIL_STR_9;
    buf += ESP32_MAIL_STR_14;
    buf += smtpData._recipient[i];
    buf += ESP32_MAIL_STR_15;

    smtpData._net->getStreamPtr()->println(buf.c_str());

    if (waitSMTPResponse(smtpData) != 250)
    {
      _smtpStatus = SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED;
      if (smtpData._sendCallback)
      {
        smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
        smtpData._cbData._success = false;
        smtpData._sendCallback(smtpData._cbData);
      }
      if (smtpData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
      }
      goto failed;
    }
  }

  for (uint8_t i = 0; i < smtpData._cc.size(); i++)
  {

    if (i == 0)
    {
      buf2 += ESP32_MAIL_STR_12;
      buf2 += ESP32_MAIL_STR_14;
      buf2 += smtpData._cc[i];
      buf2 += ESP32_MAIL_STR_15;
    }
    else
    {
      buf2 += ESP32_MAIL_STR_13;
      buf2 += smtpData._cc[i];
      buf2 += ESP32_MAIL_STR_15;
    }

    if (i == smtpData.ccCount() - 1)
      buf2 += ESP32_MAIL_STR_34;

    buf.clear();

    buf += ESP32_MAIL_STR_9;
    buf += ESP32_MAIL_STR_14;
    buf += smtpData._cc[i];
    buf += ESP32_MAIL_STR_15;
    smtpData._net->getStreamPtr()->println(buf.c_str());

    if (waitSMTPResponse(smtpData) != 250)
    {
      _smtpStatus = SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED;
      if (smtpData._sendCallback)
      {
        smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
        smtpData._cbData._success = false;
        smtpData._sendCallback(smtpData._cbData);
      }
      if (smtpData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
      }
      goto failed;
    }
  }

  for (uint8_t i = 0; i < smtpData._bcc.size(); i++)
  {
    buf.clear();
    buf += ESP32_MAIL_STR_9;
    buf += ESP32_MAIL_STR_14;
    buf += smtpData._bcc[i];
    buf += ESP32_MAIL_STR_15;
    smtpData._net->getStreamPtr()->println(buf.c_str());

    if (waitSMTPResponse(smtpData) != 250)
    {
      _smtpStatus = SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED;
      if (smtpData._sendCallback)
      {
        smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
        smtpData._cbData._success = false;
        smtpData._sendCallback(smtpData._cbData);
      }
      if (smtpData._debug)
      {
        ESP32MailDebugError();
        ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
      }
      goto failed;
    }
  }

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_126;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_243);

  smtpData._net->getStreamPtr()->println(ESP32_MAIL_STR_16);

  if (waitSMTPResponse(smtpData) != 354)
  {
    _smtpStatus = SMTP_STATUS_SEND_BODY_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  smtpData._net->getStreamPtr()->print(buf2.c_str());

  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_24);
  smtpData._net->getStreamPtr()->println(smtpData._subject.c_str());

  if (smtpData._customMessageHeader.size() > 0)
    for (uint8_t k = 0; k < smtpData._customMessageHeader.size(); k++)
      smtpData._net->getStreamPtr()->println(smtpData._customMessageHeader[k].c_str());

  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_3);
  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_1);
  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_2);
  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_35);

  buf.clear();

  set_message_header(buf, smtpData._message, smtpData._htmlFormat);

  smtpData._net->getStreamPtr()->print(buf.c_str());

  if (smtpData._attach._index > 0)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_127;
    smtpData._cbData._success = false;
    if (smtpData._sendCallback)
      smtpData._sendCallback(smtpData._cbData);
    if (smtpData._debug)
      ESP32MailDebugInfo(ESP32_MAIL_STR_244);
  }

  for (uint8_t i = 0; i < smtpData._attach._index; i++)
  {
    if (smtpData._attach._type[i] == 0)
    {

      smtpData._cbData._info = smtpData._attach._filename[i];
      smtpData._cbData._success = false;
      if (smtpData._sendCallback)
        smtpData._sendCallback(smtpData._cbData);
      if (smtpData._debug)
        ESP32MailDebug(smtpData._attach._filename[i].c_str());

      buf.clear();
      set_attachment_header(i, buf, smtpData._attach);
      smtpData._net->getStreamPtr()->print(buf.c_str());
      send_base64_encode_mime_data(smtpData._net->getStreamPtr(), smtpData._attach._buf[i].front(), smtpData._attach._size[i]);
      smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_34);
    }
    else
    {

