arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
/*
      if (!_sdOk)
      {
        if (smtpData._storageType == MailClientStorageType::SD)
          _sdOk = sdTest();
        else if (smtpData._storageType == MailClientStorageType::SPIFFS)
          _sdOk = SPIFFS.begin(true);
      }

      if (!_sdOk)
        continue;
*/
      bool file_existed = false;
/*
      if (smtpData._storageType == MailClientStorageType::SD)
        file_existed = SD.exists(smtpData._attach._filename[i].c_str());
      else if (smtpData._storageType == MailClientStorageType::SPIFFS)
        file_existed = SPIFFS.exists(smtpData._attach._filename[i].c_str());
      else if (smtpData._storageType == MailClientStorageType::FFat)
          file_existed = FFat.exists(smtpData._attach._filename[i].c_str());
*/

      file_existed = smtpData.fsp->exists(smtpData._attach._filename[i].c_str());
      if (file_existed)
      {
        smtpData._cbData._info = smtpData._attach._filename[i];
        smtpData._cbData._success = false;
        if (smtpData._sendCallback)
          smtpData._sendCallback(smtpData._cbData);

        if (smtpData._debug)
          ESP32MailDebug(smtpData._attach._filename[i].c_str());

        buf.clear();
        set_attachment_header(i, buf, smtpData._attach);
        smtpData._net->getStreamPtr()->print(buf.c_str());

        File file;
        /*
        if (smtpData._storageType == MailClientStorageType::SD)
          file = SD.open(smtpData._attach._filename[i].c_str(), FILE_READ);
        else if (smtpData._storageType == MailClientStorageType::SPIFFS)
          file = SPIFFS.open(smtpData._attach._filename[i].c_str(), FILE_READ);
        else if (smtpData._storageType == MailClientStorageType::FFat)
          file = FFat.open(smtpData._attach._filename[i].c_str(), FILE_READ);
          */
        file = smtpData.fsp->open(smtpData._attach._filename[i].c_str(), FILE_READ);

        send_base64_encode_mime_file(smtpData._net->getStreamPtr(), file);
        smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_34);
      }
    }
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_245);

  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_33);
  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_2);
  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_33);
  smtpData._net->getStreamPtr()->print(ESP32_MAIL_STR_37);

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_128;
    smtpData._cbData._success = false;
    smtpData._sendCallback(smtpData._cbData);
  }

  res = waitSMTPResponse(smtpData);

  if (res != 250 && res != -1000)
  {
    _smtpStatus = SMTP_STATUS_SEND_BODY_FAILED;
    if (smtpData._sendCallback)
    {
      smtpData._cbData._info = ESP32_MAIL_STR_53 + smtpErrorReasonStr();
      smtpData._cbData._success = false;
      smtpData._sendCallback(smtpData._cbData);
    }
    if (smtpData._debug)
    {
      ESP32MailDebugError();
      ESP32MailDebugLine(smtpErrorReasonStr().c_str(), true);
    }
    goto failed;
  }

  if (smtpData._sendCallback)
  {
    smtpData._cbData._info = ESP32_MAIL_STR_129;
    smtpData._cbData._success = true;
    smtpData._sendCallback(smtpData._cbData);
  }

  if (smtpData._debug)
    ESP32MailDebugInfo(ESP32_MAIL_STR_246);

  if (smtpData._net->connected())
    smtpData._net->getStreamPtr()->stop();

  smtpData._cbData.empty();

  std::string().swap(buf);
  std::string().swap(buf2);
  delete[] _val;

  return true;

failed:

  if (connected)
  {
    if (smtpData._net->connected())
      smtpData._net->getStreamPtr()->stop();
  }

  smtpData._cbData.empty();
  std::string().swap(buf);
  std::string().swap(buf2);
  delete[] _val;
  return false;
}

String ESP32_MailClient::smtpErrorReason()
{
  return smtpErrorReasonStr().c_str();
}

std::string ESP32_MailClient::smtpErrorReasonStr()
{
  std::string res = "";
  switch (_smtpStatus)
  {
  case SMTP_STATUS_SERVER_CONNECT_FAILED:
    res = ESP32_MAIL_STR_38;
    break;
  case SMTP_STATUS_SMTP_RESPONSE_FAILED:
    res = ESP32_MAIL_STR_39;
    break;
  case SMTP_STATUS_IDENTIFICATION_FAILED:
    res = ESP32_MAIL_STR_41;
    break;
  case SMTP_STATUS_AUTHEN_NOT_SUPPORT:
    res = ESP32_MAIL_STR_42;
    break;
  case SMTP_STATUS_AUTHEN_FAILED:
    res = ESP32_MAIL_STR_43;
    break;
  case SMTP_STATUS_USER_LOGIN_FAILED:
    res = ESP32_MAIL_STR_44;
    break;
  case SMTP_STATUS_PASSWORD_LOGIN_FAILED:
    res = ESP32_MAIL_STR_47;
    break;
  case SMTP_STATUS_SEND_HEADER_SENDER_FAILED:
    res = ESP32_MAIL_STR_48;
    break;
  case SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED:
    res = ESP32_MAIL_STR_222;
    break;
  case SMTP_STATUS_SEND_BODY_FAILED:
    res = ESP32_MAIL_STR_49;
    break;
  case MAIL_CLIENT_STATUS_WIFI_CONNECT_FAIL:
    res = ESP32_MAIL_STR_221;
    break;
  default:
    res = "";
  }
  return res;
}

String ESP32_MailClient::imapErrorReason()
{
  std::string res = "";
  switch (_imapStatus)
  {
  case IMAP_STATUS_SERVER_CONNECT_FAILED:
    res = ESP32_MAIL_STR_38;
    break;
  case IMAP_STATUS_IMAP_RESPONSE_FAILED:
    res = ESP32_MAIL_STR_40;
    break;
  case IMAP_STATUS_LOGIN_FAILED:
    res = ESP32_MAIL_STR_45;
    break;
  case IMAP_STATUS_BAD_COMMAND:
    res = ESP32_MAIL_STR_46;
    break;
  case IMAP_STATUS_PARSE_FLAG_FAILED:
    res = ESP32_MAIL_STR_256;
    break;
  case MAIL_CLIENT_STATUS_WIFI_CONNECT_FAIL:
    res = ESP32_MAIL_STR_221;
    break;
  default:
    res = "";
  }
  return res.c_str();
}

std::string ESP32_MailClient::imapErrorReasonStr()
{
  std::string res = "";

  switch (_imapStatus)
  {
  case IMAP_STATUS_SERVER_CONNECT_FAILED:
    res = ESP32_MAIL_STR_38;
    break;
  case IMAP_STATUS_IMAP_RESPONSE_FAILED:
    res = ESP32_MAIL_STR_40;
    break;
  case IMAP_STATUS_LOGIN_FAILED:
    res = ESP32_MAIL_STR_45;
    break;
  case IMAP_STATUS_BAD_COMMAND:
    res = ESP32_MAIL_STR_46;
    break;
  case IMAP_STATUS_PARSE_FLAG_FAILED:
    res = ESP32_MAIL_STR_256;
    break;
  case MAIL_CLIENT_STATUS_WIFI_CONNECT_FAIL:
    res = ESP32_MAIL_STR_221;
    break;
  default:
    res = "";
  }
  return res;
}

void ESP32_MailClient::ESP32MailDebugError()
{
  size_t dbgInfoLen = strlen_P(ESP32_MAIL_STR_227) + 1;
  char *dbgInfo = new char[dbgInfoLen];
  memset(dbgInfo, 0, dbgInfoLen);
  strcpy_P(dbgInfo, ESP32_MAIL_STR_227);
  ESP32MailDebugLine(dbgInfo, false);
  delete[] dbgInfo;
}

void ESP32_MailClient::ESP32MailDebugInfo(PGM_P info)
{
  size_t dbgInfoLen = strlen_P(info) + 1;
  char *dbgInfo = new char[dbgInfoLen];
  memset(dbgInfo, 0, dbgInfoLen);
  strcpy_P(dbgInfo, info);
  ESP32MailDebug(dbgInfo);
  delete[] dbgInfo;
}

bool ESP32_MailClient::sdBegin(uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t ss)
{
  _sck = sck;
  _miso = miso;
  _mosi = mosi;
  _ss = ss;
  _sdConfigSet = true;

  SPI.begin(_sck, _miso, _mosi, _ss);
  return SD.begin(_ss, SPI);
}

bool ESP32_MailClient::sdBegin(void)
{
  _sdConfigSet = false;
  return SD.begin();
}

