arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
void ESP32_MailClient::set_message_header(string &header, string &message, bool htmlFormat)
{
  header += ESP32_MAIL_STR_33;
  header += ESP32_MAIL_STR_2;
  header += ESP32_MAIL_STR_34;
  if (!htmlFormat)
    header += ESP32_MAIL_STR_27;
  else
    header += ESP32_MAIL_STR_28;

  header += ESP32_MAIL_STR_29;
  header += ESP32_MAIL_STR_34;

  header += message;
  header += ESP32_MAIL_STR_34;
  header += ESP32_MAIL_STR_34;
}

void ESP32_MailClient::set_attachment_header(uint8_t index, std::string &header, attachmentData &attach)
{

  header += ESP32_MAIL_STR_33;
  header += ESP32_MAIL_STR_2;
  header += ESP32_MAIL_STR_34;

  header += ESP32_MAIL_STR_25;

  if (attach._mime_type[index].length() == 0)
    header += ESP32_MAIL_STR_32;
  else
    header += attach._mime_type[index];

  header += ESP32_MAIL_STR_26;

  std::string filename(attach._filename[index]);

  size_t found = filename.find_last_of("/\\");

  if (found != std::string::npos)
  {
    filename.clear();
    filename += attach._filename[index].substr(found + 1);
  }

  header += filename;
  header += ESP32_MAIL_STR_36;

  header += ESP32_MAIL_STR_30;
  header += filename;
  header += ESP32_MAIL_STR_36;

  header += ESP32_MAIL_STR_31;
  header += ESP32_MAIL_STR_34;

  std::string().swap(filename);
}

int ESP32_MailClient::waitSMTPResponse(SMTPData &smtpData)
{

  long dataTime = millis();
  char c = '\0';
  std::string lineBuf = "";
  int lfCount = 0;
  size_t p1 = 0;
  int resCode = -1000;

  while (smtpClientAvailable(smtpData, false) && millis() - dataTime < smtpData._net->tcpTimeout)
    delay(0);

  dataTime = millis();
  if (smtpClientAvailable(smtpData, true))
  {
    while (smtpClientAvailable(smtpData, true))
    {
      int r = smtpData._net->getStreamPtr()->read();

      if (r < 0)
        continue;

      c = (char)r;

      lineBuf.append(1, c);
      if (c == '\n')
      {
        dataTime = millis();
        if (lfCount == 0)
        {
          p1 = lineBuf.find(" ");
          if (p1 != std::string::npos)
            resCode = atoi(lineBuf.substr(0, p1).c_str());
        }
        if (smtpData._debug)
          ESP32MailDebug(lineBuf.c_str());
        lineBuf.clear();
        lfCount++;
      }

      if (millis() - dataTime > smtpData._net->tcpTimeout + 30000)
        break;
    }
  }
  std::string().swap(lineBuf);
  return resCode;
}

bool ESP32_MailClient::getIMAPResponse(IMAPData &imapData)
{
  long dataTime = millis();
  char c = '\0';
  bool success = false;
  std::string str = "";
  while (imapClientAvailable(imapData, false) && millis() - dataTime < imapData._net->tcpTimeout)
    delay(0);

  dataTime = millis();
  if (imapClientAvailable(imapData, true))
  {
    while (imapClientAvailable(imapData, true))
    {
      int r = imapData._net->getStreamPtr()->read();
      if (r < 0)
        continue;
      c = (char)r;
      if (c == '\n')
      {
        if (imapData._debug)
          ESP32MailDebug(str.c_str());
        str.clear();
      }
      else
        str += c;

      if (str.find(ESP32_MAIL_STR_132) != std::string::npos)
        success = true;
    }
  }

  std::string().swap(str);
  return success;
}

bool ESP32_MailClient::waitIMAPResponse(IMAPData &imapData, uint8_t imapCommandType, int maxChar, int mailIndex, int messageDataIndex, std::string part)
{

  long dataTime = millis();

  char c = 0;
  std::string lineBuf = "";
  std::string msgNumBuf = "";
  std::string filepath = "";
  std::string hpath = "";
  std::string tmp = "";
  std::string msgID = "";
  std::string from = "";
  std::string to = "";
  std::string subject = "";
  std::string date = "";
  std::string cc = "";
  std::string from_charset = "";
  std::string to_charset = "";
  std::string cc_charset = "";
  std::string subject_charset = "";
  std::string acceptLanguage = "";
  std::string contentLanguage = "";

  int bufSize = 100;
  char *dest = new char[bufSize];
  char *buf = new char[bufSize];

  int readCount = 0;
  int lfCount = 0;
  int charCount = 0;
  size_t p1 = 0;
  size_t p2 = 0;
  size_t p3 = 0;
  size_t payloadLength = 0;
  size_t outputLength;

  bool completeResp = false;
  bool validResponse = false;
  bool downloadReq = false;
  size_t currentDownloadByte = 0;

  int max = imapData._emailNumMax;
  if (!imapData._recentSort)
    max = max - 1;

  uint8_t headerType = 0;

  File file;
  int reportState = 0;
  int downloadedByte = 0;

  if (imapCommandType == IMAP_COMMAND_TYPE::LIST)
    std::vector<std::string>()
        .swap(imapData._folders);

  while (imapClientAvailable(imapData, false) && millis() - dataTime < imapData._net->tcpTimeout)
    delay(0);

  dataTime = millis();
  if (imapClientAvailable(imapData, true))
  {
    while (imapClientAvailable(imapData, true) || !completeResp)
    {

      int r = imapData._net->getStreamPtr()->read();

      if (r < 0)
        continue;

      c = (char)r;

      if (payloadLength > 0 && !completeResp)
        charCount++;

      if (imapCommandType == IMAP_COMMAND_TYPE::SEARCH && lfCount == 0)
      {
        delay(0);
        if (c == ' ')
        {
          p3 = msgNumBuf.find(ESP32_MAIL_STR_257);
          if (p3 != std::string::npos)
          {
            validResponse = false;
            break;
          }

          if (msgNumBuf != ESP32_MAIL_STR_183 && msgNumBuf != ESP32_MAIL_STR_141 && imapData._msgNum.size() <= max)
          {
            imapData._msgNum.push_back(atoi(msgNumBuf.c_str()));

            if (imapData._msgNum.size() > imapData._emailNumMax && imapData._recentSort)
              imapData._msgNum.erase(imapData._msgNum.begin());
            imapData._searchCount++;
          }

          msgNumBuf.clear();
        }
        else if (c != '\r' && c != '\n')
        {
          msgNumBuf.append(1, c);
        }
      }

      if (c != '\r' && c != '\n' && imapCommandType != IMAP_COMMAND_TYPE::SEARCH)
        lineBuf.append(1, c);

      if (validResponse && imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_TEXT && lfCount > 0)
      {

        if (payloadLength > 0 && charCount < payloadLength - 1)
        {

          if (imapData._messageDataInfo[mailIndex][messageDataIndex]._transfer_encoding != ESP32_MAIL_STR_160)
          {
            if (charCount < maxChar)
              imapData._messageDataInfo[mailIndex][messageDataIndex]._text.append(1, c);

            if (imapData._saveHTMLMsg || imapData._saveTextMsg)
            {

