arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
              if (!imapData._messageDataInfo[mailIndex][messageDataIndex]._sdFileOpenWrite)
              {
                imapData._messageDataInfo[mailIndex][messageDataIndex]._sdFileOpenWrite = true;

                if (_sdOk)
                {
                  downloadReq = true;

                  filepath.clear();

                  filepath = imapData._savePath;
                  filepath += ESP32_MAIL_STR_202;

                  char *midx = new char[50];
                  memset(midx, 0, 50);
                  itoa(imapData._msgNum[mailIndex], midx, 10);

                  filepath += midx;

                  delete[] midx;

                  if (imapData._storageType == MailClientStorageType::SD)
                    if (!imapData.fsp->exists(filepath.c_str()))
                      createDirs(filepath);

                  if (!imapData._headerSaved)
                    hpath = filepath + ESP32_MAIL_STR_203;

                  if (imapData._messageDataInfo[mailIndex][messageDataIndex]._contentType == ESP32_MAIL_STR_155)
                  {
                    if (imapData._saveDecodedText)
                      filepath += ESP32_MAIL_STR_161;
                    else
                      filepath += ESP32_MAIL_STR_162;
                  }
                  else if (imapData._messageDataInfo[mailIndex][messageDataIndex]._contentType == ESP32_MAIL_STR_154)
                  {
                    if (imapData._saveDecodedHTML)
                      filepath += ESP32_MAIL_STR_163;
                    else
                      filepath += ESP32_MAIL_STR_164;
                  }

                  if (imapData._storageType == MailClientStorageType::SD)
                    file = imapData.fsp->open(filepath.c_str(), FILE_WRITE);
                  else if (imapData._storageType == MailClientStorageType::SPIFFS)
                    file = SPIFFS.open(filepath.c_str(), FILE_WRITE);
                }
                else
                {

                  if (imapData._messageDataCount[mailIndex] == messageDataIndex + 1)
                  {
                    imapData._messageDataInfo[mailIndex][messageDataIndex]._error = true;
                    imapData._messageDataInfo[mailIndex][messageDataIndex]._downloadError.clear();
                    imapData._messageDataInfo[mailIndex][messageDataIndex]._downloadError = ESP32_MAIL_STR_89;
                  }
                }
              }
              if (_sdOk)
                file.write(c);
            }
          }
        }

        if (millis() - dataTime > imapData._net->tcpTimeout + (30 * 1000) || (payloadLength > 0 && charCount == payloadLength && completeResp))
        {

          if (charCount < payloadLength || !completeResp)
            clientReadAll(imapData._net->getStreamPtr());

          break;
        }
      }

      if (c == '\n')
      {
        dataTime = millis();

        if (lfCount == 0)
        {
          if (imapData._debug)
            ESP32MailDebug(lineBuf.c_str());

          if (imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_TEXT ||
              imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_MIME ||
              imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_HEADER ||
              imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_ATTACHMENT)
          {

            p1 = lineBuf.find(ESP32_MAIL_STR_165);
            if (p1 != std::string::npos)
              validResponse = true;
          }

          p1 = lineBuf.find(ESP32_MAIL_STR_166);
          if (p1 != std::string::npos)
            validResponse = true;
        }

        p1 = lineBuf.find(ESP32_MAIL_STR_211);
        p2 = lineBuf.find(ESP32_MAIL_STR_158);
        p3 = lineBuf.find(ESP32_MAIL_STR_159);

        if (p1 != std::string::npos || p2 != std::string::npos || p3 != std::string::npos)
        {

          validResponse = true;

          if (p2 != std::string::npos || p3 != std::string::npos)
            validResponse = false;

          if (payloadLength == 0)
          {
            if (imapCommandType == IMAP_COMMAND_TYPE::LOGIN ||
                imapCommandType == IMAP_COMMAND_TYPE::LIST ||
                imapCommandType == IMAP_COMMAND_TYPE::EXAMINE ||
                imapCommandType == IMAP_COMMAND_TYPE::SEARCH ||
                imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_MIME ||
                imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_HEADER)
            {

              //Cyrus server 3.0 does not comply to rfc3501 as it resonses the CAPABILITY after received LOGIN command with no CAPABILITY command requested.
              if (lineBuf.find(ESP32_MAIL_STR_134) == std::string::npos && lineBuf.find(ESP32_MAIL_STR_145) == std::string::npos)
                completeResp = true;

              //Some servers e.g. STRATO E-Mail-Server does not reply any error when fetching none existing MIME header part at defined index.
              if (imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_MIME)
                validResponse = false;
            }
          }
          else
          {

            if ((payloadLength > 0 && charCount >= payloadLength) || imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_MIME)
            {
              completeResp = true;
            }
          }
        }

        if (imapCommandType == IMAP_COMMAND_TYPE::SEARCH && lfCount > 0)
        {
          completeResp = true;
          validResponse = true;
        }

        tmp = lineBuf;
        std::transform(tmp.begin(), tmp.end(), tmp.begin(), ::tolower);

        if (imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_MIME && lfCount > 0)
        {

          if (payloadLength > 0 && validResponse)
          {

            if (imapData._messageDataInfo[mailIndex].size() < messageDataIndex + 1)
            {
              messageBodyData b;
              imapData._messageDataInfo[mailIndex].push_back(b);
              imapData._messageDataCount[mailIndex] = imapData._messageDataInfo[mailIndex].size();
            }

            p1 = tmp.find(ESP32_MAIL_STR_167);
            if (p1 != std::string::npos)
            {

              p2 = lineBuf.find(";", p1 + strlen(ESP32_MAIL_STR_167));
              if (p2 != std::string::npos)
              {

