arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
            if (!imapData._messageDataInfo[mailIndex][messageDataIndex]._sdFileOpenWrite)
            {

              imapData._messageDataInfo[mailIndex][messageDataIndex]._sdFileOpenWrite = true;

              if (_sdOk)
              {

                downloadReq = true;

                filepath.clear();
                filepath += imapData._savePath;
                filepath += ESP32_MAIL_STR_202;

                char *midx = new char[50];
                memset(midx, 0, 50);
                itoa(imapData._msgNum[mailIndex], midx, 10);

                filepath += midx;

                delete[] midx;

                if (imapData._storageType == MailClientStorageType::SD)
                  if (!imapData.fsp->exists(filepath.c_str()))
                    createDirs(filepath);

                filepath += ESP32_MAIL_STR_202;

                filepath += imapData._messageDataInfo[mailIndex][messageDataIndex]._filename;

                if (imapData._storageType == MailClientStorageType::SD)
                  file = imapData.fsp->open(filepath.c_str(), FILE_WRITE);
                else if (imapData._storageType == MailClientStorageType::SPIFFS)
                  file = SPIFFS.open(filepath.c_str(), FILE_WRITE);
              }
              else
              {
                if (imapData._messageDataCount[mailIndex] == messageDataIndex + 1)
                {
                  imapData._messageDataInfo[mailIndex][messageDataIndex]._error = true;
                  imapData._messageDataInfo[mailIndex][messageDataIndex]._downloadError.clear();
                  imapData._messageDataInfo[mailIndex][messageDataIndex]._downloadError = ESP32_MAIL_STR_89;
                }
              }
            }

            if (_sdOk)
            {

              unsigned char *decoded = base64_decode_char((const unsigned char *)lineBuf.c_str(), lineBuf.length(), &outputLength);

              downloadedByte += outputLength;

              if (downloadedByte > imapData._messageDataInfo[mailIndex][messageDataIndex]._size)
                continue;

              if (decoded)
              {
                file.write((const uint8_t *)decoded, outputLength);

                if (imapData._storageType == MailClientStorageType::SPIFFS)
                  delayMicroseconds(1);
                else
                  yield();

                if (imapData._downloadReport)
                {
                  imapData._downloadedByte[mailIndex] += outputLength;
                  currentDownloadByte += outputLength;

                  if (imapData._messageDataInfo[mailIndex][messageDataIndex]._size == 0)
                  {
                    if (payloadLength > 36)
                    {
                      imapData._messageDataInfo[mailIndex][messageDataIndex]._size = base64DecodeSize(lineBuf, payloadLength - (payloadLength / 36));
                      imapData._totalAttachFileSize[mailIndex] += imapData._messageDataInfo[mailIndex][messageDataIndex]._size;
                    }
                  }

                  int p = 0;

                  if (imapData._totalAttachFileSize[mailIndex] > 0)
                    p = 100 * imapData._downloadedByte[mailIndex] / imapData._totalAttachFileSize[mailIndex];

                  if ((p % 5 == 0) && (p <= 100))
                  {

                    if (imapData._readCallback && reportState != -1)
                    {
                      memset(buf, 0, bufSize);
                      itoa(p, buf, 10);

                      std::string dl = ESP32_MAIL_STR_90 + imapData._messageDataInfo[mailIndex][messageDataIndex]._filename + ESP32_MAIL_STR_91 + buf + ESP32_MAIL_STR_92;

                      if (imapData._readCallback)
                      {
                        imapData._cbData._info = dl;
                        imapData._cbData._status = dl;
                        imapData._cbData._success = false;
                        imapData._readCallback(imapData._cbData);
                      }

                      std::string().swap(dl);
                    }
                    reportState = -1;
                  }
                  else
                    reportState = 0;
                }

                delete[] decoded;
              }

              if (millis() - dataTime > imapData._net->tcpTimeout + 1000 * 60 * 5)
                break;
            }
          }
        }

        if (lfCount == 0)
        {
          p1 = lineBuf.find_last_of(ESP32_MAIL_STR_193);
          if (p1 != std::string::npos)
          {
            p2 = lineBuf.find(ESP32_MAIL_STR_194, p1 + 1);
            if (p2 != std::string::npos)
              payloadLength = atoi(lineBuf.substr(p1 + 1, p2 - p1 - 1).c_str());
          }
        }

        lineBuf.clear();
        lfCount++;
        std::string().swap(tmp);
      }

      readCount++;
    }

    if (imapData._error.size() > 0 && mailIndex > -1)
    {
      if (validResponse && !imapData._error[mailIndex])
      {
        imapData._errorMsg[mailIndex].clear();
        imapData._errorMsg[mailIndex] = "";
      }
    }

    if (millis() - dataTime > imapData._net->tcpTimeout)
    {

      if (downloadReq)
      {
        if (imapData._messageDataCount[mailIndex] == messageDataIndex + 1)
        {
          imapData._messageDataInfo[mailIndex][messageDataIndex]._error = true;
          imapData._messageDataInfo[mailIndex][messageDataIndex]._downloadError.clear();
          imapData._messageDataInfo[mailIndex][messageDataIndex]._downloadError = ESP32_MAIL_STR_93;
        }
      }
      else
      {

        if (imapData._error.size() > 0 && mailIndex > -1)
        {
          imapData._error[mailIndex] = true;
          imapData._errorMsg[mailIndex].clear();
          imapData._errorMsg[mailIndex] = ESP32_MAIL_STR_95;
        }
      }
    }
  }

  if (validResponse && (imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_ATTACHMENT || imapCommandType == IMAP_COMMAND_TYPE::FETCH_BODY_TEXT) && messageDataIndex != -1)
  {
    if (imapData._messageDataInfo[mailIndex][messageDataIndex]._sdFileOpenWrite)
      file.close();
  }

