arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.cpp
uint8_t SMTPData::attachDataCount()
{
  uint8_t count = 0;
  for (uint8_t i = 0; i < _attach.getCount(); i++)
    if (_attach.getType(i) == 0)
      count++;

  return count;
}

void SMTPData::addAttachFile(const String &filePath, const String &mimeType)
{
  _attach.add(filePath, mimeType, NULL, 0);
}

void SMTPData::removeAttachFile(const String &filePath)
{
  for (uint8_t i = 0; i < _attach.getCount(); i++)
    if (_attach.getFileName(i) == filePath && _attach.getType(i) == 1)
    {
      _attach.remove(i);
    }
}

void SMTPData::removeAttachFile(uint8_t index)
{
  uint8_t id = 0;
  for (uint8_t i = 0; i < _attach.getCount(); i++)
    if (_attach.getType(i) == 1)
    {
      if (id == index)
      {
        _attach.remove(i);
        break;
      }
      id++;
    }
}

void SMTPData::setFileStorageType(uint8_t storageType)
{
  _storageType = storageType;
  switch (storageType) {
    case MailClientStorageType::SPIFFS:
      fsp = &SPIFFS;
      break;
    case MailClientStorageType::SD:
      fsp = &SD;
      break;
    case MailClientStorageType::FFat:
      fsp = &FFat;
      break;
    case MailClientStorageType::Univ:
      fsp = ufsp;
      break;
  }
}

void SMTPData::clearAttachData()
{
  for (uint8_t i = 0; i < _attach.getCount(); i++)
    if (_attach.getType(i) == 0)
      _attach.remove(i);
}

void SMTPData::clearAttachFile()
{
  for (uint8_t i = 0; i < _attach.getCount(); i++)
    if (_attach.getType(i) == 1)
      _attach.remove(i);
}

void SMTPData::clearAttachment()
{
  _attach.free();
}

uint8_t SMTPData::attachFileCount()
{
  uint8_t count = 0;
  for (uint8_t i = 0; i < _attach.getCount(); i++)
    if (_attach.getType(i) == 1)
      count++;

  return count;
}

void SMTPData::addCustomMessageHeader(const String &commmand)
{
  _customMessageHeader.insert(_customMessageHeader.end(), commmand.c_str());
}

void SMTPData::removeCustomMessageHeader(const String &commmand)
{
  for (uint8_t i = 0; i < _customMessageHeader.size(); i++)
    if (_customMessageHeader[i].c_str() == commmand.c_str())
      _customMessageHeader.erase(_customMessageHeader.begin() + i);
}

void SMTPData::removeCustomMessageHeader(uint8_t index)
{
  _customMessageHeader.erase(_customMessageHeader.begin() + index);
}

void SMTPData::clearCustomMessageHeader()
{
  std::vector<std::string>().swap(_customMessageHeader);
}

uint8_t SMTPData::CustomMessageHeaderCount()
{
  return _customMessageHeader.size();
}

String SMTPData::getCustomMessageHeader(uint8_t index)
{
  if (index >= _customMessageHeader.size())
    return std::string().c_str();
  return _customMessageHeader[index].c_str();
}

void SMTPData::empty()
{
  std::string().swap(_host);
  std::string().swap(_loginEmail);
  std::string().swap(_loginPassword);
  std::string().swap(_fromName);
  std::string().swap(_senderEmail);
  std::string().swap(_subject);
  std::string().swap(_message);
  clearRecipient();
  clearCustomMessageHeader();
  clearCC();
  clearBCC();
  clearAttachment();
}

void SMTPData::setSendCallback(sendStatusCallback sendCallback)
{
  _sendCallback = std::move(sendCallback);
}

ReadStatus::ReadStatus()
{
}
ReadStatus::~ReadStatus()
{
  empty();
}

String ReadStatus::status()
{
  return _status.c_str();
}
String ReadStatus::info()
{
  return _info.c_str();
}

bool ReadStatus::success()
{
  return _success;
}
void ReadStatus::empty()
{
  std::string().swap(_info);
  std::string().swap(_status);
}

SendStatus::SendStatus()
{
}

SendStatus::~SendStatus()
{
  empty();
}

String SendStatus::info()
{
  return _info.c_str();
}
bool SendStatus::success()
{
  return _success;
}
void SendStatus::empty()
{
  std::string().swap(_info);
}

ESP32_MailClient MailClient = ESP32_MailClient();

#endif //ESP32

#endif //ESP32_MailClient_CPP
